selenium/feature_tests/src/test/resources/testfiles/genricReportingUAE/importFailure.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:cxf="http://cxf.component.camel.apache.org/">
    <soapenv:Header />
    <soapenv:Body>
        <n1:envelope
                xmlns:n1="http://www.sap.com/sap_ich4ls/"
                xmlns:prx="urn:sap.com:proxy:Y21:/1SAI/TAS8FB8FF2B37F00B51AA2D:740"
                xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
            <message date="2022-07-14" time="07:53:37">
                <id>42010AEECDE11EED8EE76FB93226T2BB</id>
            </message>
            <sender agency="GS1" scheme="GLN">0355801000002</sender>
            <recipients>
                <id agency="SAP" scheme="RegReport">RR_SA_ICH_IMPORT</id>
            </recipients>
            <content encoding="XML" format="ATTP" type="GenericReporting" version="1.0">
                <ATTPGRDocument>
                    <GRHeader>
                        <GRHeaderBase>
                            <ReceiverId>RR_SA_ICH_IMPORT</ReceiverId>
                            <InstanceId>42010AEECDE11EED8EE76FB93226T2BB</InstanceId>
                            <DateTime>2022-09-23T12:30:22Z</DateTime>
                            <VariantName>RR_SA_IMPORT</VariantName>
                            <VariantVersion>1 </VariantVersion>
                        </GRHeaderBase>
                        <ContentList>
                            <Content type="Event">
                                <ContentItem id="1-OBSERVE">
                                    <ContentItemSection type="Details">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtReadpntGln">6823034800002</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                </ContentItem>
                            </Content>
                        </ContentList>
                    </GRHeader>
                    <GRBody>
                        <ObjContentList>
                            <ObjContent type="LotRefList">
                                <ObjContentGroup>
                                    <ObjCode id="011122334455667510SFDAQOSAIBHEENA" type="LGTIN" dateManuf="2022-09-23" dateExp="2025-09-23"/>
                                </ObjContentGroup>
                            </ObjContent>
                            <ObjContent type="SGTINList">
                                <ObjContentGroup>
                                    <ObjCode id="011122334455667521VVFJON6lY6E" type="SGTIN" lotRef="SFDAQOSAIBHEENA"/>
                                    <ObjCode id="011122334455667521UP8BHQ09U7N" type="SGTIN" lotRef="SFDAQOSAIBHEENA"/>
                                </ObjContentGroup>
                            </ObjContent>
                        </ObjContentList>
                    </GRBody>
                </ATTPGRDocument>
            </content>
        </n1:envelope>
    </soapenv:Body>
</soapenv:Envelope>